---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.DimensionOverconstrainedError
source: html/c7865c6c-4da8-9288-7c86-72e344a2a64c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.DimensionOverconstrainedError Property

The Dimension would overconstrain the Sketch.

## Syntax (C#)
```csharp
public static FailureDefinitionId DimensionOverconstrainedError { get; }
```